# Taps
tap "homebrew/bundle"

# ══════════════════════════════════════════
# SHELL Y TERMINAL
# ══════════════════════════════════════════
brew "fish"           # Shell principal
brew "starship"       # Prompt
brew "atuin"          # Historial de comandos
brew "zellij"         # Multiplexor

# ══════════════════════════════════════════
# NAVEGACION Y BUSQUEDA
# ══════════════════════════════════════════
brew "zoxide"         # cd inteligente
brew "fzf"            # Fuzzy finder
brew "ripgrep"        # Busqueda rapida (rg)
brew "fd"             # Find moderno
brew "yazi"           # File manager
brew "bat"            # Cat con syntax highlighting
brew "eza"            # ls moderno
brew "tree"           # Arbol de directorios

# ══════════════════════════════════════════
# GIT Y CONTROL DE VERSIONES
# ══════════════════════════════════════════
brew "git"
brew "lazygit"        # Git TUI
brew "gh"             # GitHub CLI
brew "delta"          # Diff mejorado

# ══════════════════════════════════════════
# EDITOR Y LSP
# ══════════════════════════════════════════
brew "neovim"
brew "tree-sitter"    # Parser para syntax
brew "luarocks"       # Lua dependencies

# ══════════════════════════════════════════
# GESTOR DE VERSIONES
# ══════════════════════════════════════════
brew "mise"           # Gestor de Node/Yarn

# ══════════════════════════════════════════
# FORMATTERS Y LINTERS (Neovim deps)
# ══════════════════════════════════════════
brew "stylua"         # Lua formatter
brew "prettier"       # JS/TS/JSON/HTML/CSS formatter
brew "eslint"         # JS/TS linter
brew "shfmt"          # Shell formatter

# ══════════════════════════════════════════
# DEPENDENCIAS DE YAZI (previews)
# ══════════════════════════════════════════
brew "file"           # Detectar tipos de archivo
brew "unar"           # Previsualizar archivos comprimidos
brew "poppler"        # Previsualizar PDFs
brew "ffmpegthumbnailer"  # Thumbnails de video
brew "imagemagick"    # Procesamiento de imagenes

# ══════════════════════════════════════════
# UTILIDADES
# ══════════════════════════════════════════
brew "jq"             # JSON processor
brew "yq"             # YAML processor
brew "curl"           # HTTP client
brew "wget"           # Descargas
brew "htop"           # Monitor de procesos
brew "lazydocker"     # Docker TUI
brew "direnv"         # Env por directorio

# ══════════════════════════════════════════
# macOS ONLY
# ══════════════════════════════════════════
if OS.mac?
  cask "kitty"
  cask "font-iosevka-term-nerd-font"
  cask "docker"
end
